Output from `terraform plan`
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_object.glue_job_shared_custom_log4j_properties will be updated in-place
  ~ resource "aws_s3_object" "glue_job_shared_custom_log4j_properties" {
      ~ etag                          = "a74d2a506e5a9296d6d90a05b30d3893" -> "a16f83edfb0b801002a664e77e242b9a"
        id                            = "logging/ingestion-jobs/log4j2.properties"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.postgres_tickle_lambda_trigger["dps-calc-rel-date"].aws_scheduler_schedule.schedule[0] will be created
  + resource "aws_scheduler_schedule" "schedule" {
      + arn                          = (known after apply)
      + description                  = "Triggers the Postgres Tickle Lambda Based on a Given Schedule"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dpr-postgres-tickle-trigger-dps-dps-calc-rel-date-preproduction"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "rate(10 minutes)"
      + schedule_expression_timezone = "Europe/London"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:lambda:eu-west-2:972272129531:function:dpr-postgres-tickle-function"
          + input    = jsonencode(
                {
                  + secretId = "external/dpr-dps-calc-rel-date-source-secrets"
                }
            )
          + role_arn = "arn:aws:iam::972272129531:role/dpr-lambda-function-invocation-role"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```